#include <iostream>
#include <cstdlib>
using namespace std;
// Задание 1 «Имя». Написать программу, которая выводит на экран Ваше имя.
int main()
{
    cout<<"Ramin"<<endl;
    return 0;
}